t21/Walnut_X/Packages/.cache/Infineon.TLE986x_DFP.1.2.4.pdsc
		  <device Dname="TLE9869QXA20">
			<processor Dclock="24000000"/>
			<compile header="Device\Include\TLE986x.h" define="TLE9869QXA20"/>
			<debug      svd="SVD\TLE986x.svd"/>
			<memory     id="IROM1"                      start="0x11000000"  size="0x1EFFC"     startup="1"   default="1"/>
			<memory     id="IROM2"                      start="0x1101EFFC"  size="4"           startup="0"   default="1"/>
			<memory     id="IRAM1"                      start="0x18000000"  size="0x1800"      init   ="0"   default="1"/>
			<algorithm  name="Flash\TLE9869.FLM"     start="0x11000000"  size="0x20000"                      default="1"/>
			<book    name="Documents\TLE986xQX-Users-Manual-10-Infineon.pdf"   title="TLE986x Series Reference Manual"/>
			<book    name="Documents\TLE986xQX-BootROM-User-Manual-13-Infineon.pdf"   title="TLE986x Series BootROM Manual"/>
			<book    name="Documents\TLE9869QXA20-Data-Sheet-10-Infineon.pdf"  title="TLE9869QXA20 Data Sheet"/>
			<feature type="ADC"           n="1"       m="10"/>
			<feature type="ADC"           n="1"       m="8"/>
			<feature type="IOs"           n="11"/>
		  </device>
      </subFamily>
   </family>
  </devices>

  <conditions>                                                                
  <!-- conditions are dependency rules that can apply to a component or an individual file -->
    <condition id="TLE986x CMSIS Device">                                     
    <!-- conditions selecting Devices -->
      <description>Infineon TLE986x device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Cclass="Device" Cgroup="SDK" Csub="SCU"/>
      <require Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
      <require Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
      <require Cclass="Device" Cgroup="SDK" Csub="ISR"/>
      <require Cclass="Device" Cgroup="SDK" Csub="INT"/>
      <require Dvendor="Infineon:7" Dname="TLE986*QX*"/>
    </condition>

    <condition id="TLE986x">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE986x device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE986*QX*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="TLE9861QXA20">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9861QXA20 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9861QXA20"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9867QXA20">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9867QXA20 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9867QXA20"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9867QXA40">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9867QXA40 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9867QXA40"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9867QXW40">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9867QXW40 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9867QXW40"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9869QXA20">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9869QXA20 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9869QXA20"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="TLE9861 ARM">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9861 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9861QXA*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9867 ARM">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9867 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9867QX*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9869 ARM">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9869 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9869QXA*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
  </conditions>

    <boards>
     <board vendor="Infineon" name="TLE986x Eval.Board" revision="V1.2" salesContact="sales@infineon.com" orderForm="http://www.infineon.com/embeddedpower">
      <description>Infineon TLE9869 Eval. Board Support and Examples</description>
      <image small="Images\TLE986x-EvalBoard-rev1_small.jpg" large="Images\TLE986x-EvalBoard-rev1_1_big.jpg"/>
      <book category="overview"  name="http://www.infineon.com/cms/en/product/evaluation-boards/TLE986X+EVALBOARD/evaluation-boards/TLE986X+EVALBOARD/productType.html?productType=5546d46249cd10140149e1ff081a5d2d" title="TLE986x Eval.Board Web Page"/>
      <book category="setup"     name="Documents\IFX_TLE986x_EvalBoard.pdf" title="Getting Started"/>
      <book category="schematic" name="Documents\TLE986x_ver_1.2.zip" title="Schematics"/>
      <!--<mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="TLE9869QXA20"/>-->
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="TLE986x Series"/>
  	    <feature type="ODbg"      n="1"              name="On-board J-LINK Lite"/>
	    <feature type="PWR"       n="5"              name="USB Powered"/>
	    <feature type="PWR"       n="12" m="5"      name="POWER Connector for external supply"/>
	    <feature type="DIO"       n="13"             name="Pins at pin headers"/>
	    <feature type="AIO"       n="3"              name="Analog inputs at AD"/>
	    <feature type="LED"       n="8"              name="User LEDs"/>
      <debugInterface adapter="J-Link Lite" connector="Mini-USB"/>
    </board>
  </boards>

