t21/Walnut_X/Packages/.cache/Infineon.TLE986x_DFP.1.2.4.pdsc
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TLE986x CMSIS Device">  <!-- Cversion is necessary -->
      <description>System Startup for Infineon TLE986x device series</description>
      <files>
        <!--  include folder -->
        <file category="include" name="Device\Include\"/>
		
		<!-- startup files -->
        <file category="source" name="Device\Source\ARM\startup_TLE986x.s" condition="TLE9861 ARM" version="1.0"/>
        <file category="source" name="Device\Source\ARM\startup_TLE986x.s" condition="TLE9867 ARM" version="1.0"/>
        <file category="source" name="Device\Source\ARM\startup_TLE986x.s" condition="TLE9869 ARM" version="1.0"/>

		<!-- system file -->      
        <file category="source" name="Device\Source\system_TLE986x.c" condition="TLE9861 ARM" version="1.1"/>
        <file category="source" name="Device\Source\system_TLE986x.c" condition="TLE9867 ARM" version="1.1"/>
        <file category="source" name="Device\Source\system_TLE986x.c" condition="TLE9869 ARM" version="1.1"/>

        <file category="include" name="Device\SDK\cfgwiz\TLE9861QXA20\" condition="TLE9861QXA20"/>      
        <file category="include" name="Device\SDK\cfgwiz\TLE9861QXA20\" condition="TLE9867QXA20"/>      
        <file category="include" name="Device\SDK\cfgwiz\TLE9867QXA40\" condition="TLE9867QXA40"/>      
        <file category="include" name="Device\SDK\cfgwiz\TLE9867QXA40\" condition="TLE9867QXW40"/>      
        <file category="include" name="Device\SDK\cfgwiz\TLE9869QXA20\" condition="TLE9869QXA20"/>
        <file category="include" name="Device\SDK\cfgwiz\common\"/>
        <file category="header"  name="Device\SDK\cfgwiz\TLE9861QXA20\bsl_defines.h" attr="config" condition="TLE9861QXA20" version="1.8"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA20\bsl_defines.h" attr="config" condition="TLE9867QXA20" version="1.8"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\bsl_defines.h" attr="config" condition="TLE9867QXA40" version="1.8"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\bsl_defines.h" attr="config" condition="TLE9867QXW40" version="1.8"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9869QXA20\bsl_defines.h" attr="config" condition="TLE9869QXA20" version="1.8"/>   

        <file category="sourceC" name="Device\SDK\app\main.c" attr="template" select="Simple Main" condition="TLE986x" version="1.8"/> 		
     </files>
    </component>

	<!-- START: Infineon Standard Peripherals Low Level Drivers -->
    <component Cclass="Device" Cgroup="ConfigWizard" Cversion="1.8.2" condition="TLE986x">  <!-- Cversion is necessary -->
	 <description>Infineon ConfigWizard Configuration File</description>
	 <files>
        <file category="source" name="Device\SDK\cfgwiz\TLE9861QXA20\config.icwp" attr="config" condition="TLE9861QXA20" version="1.8.2"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9867QXA20\config.icwp" attr="config" condition="TLE9867QXA20" version="1.8.2"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9867QXA40\config.icwp" attr="config" condition="TLE9867QXA40" version="1.8.2"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9867QXA40\config.icwp" attr="config" condition="TLE9867QXW40" version="1.8.2"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9869QXA20\config.icwp" attr="config" condition="TLE9869QXA20" version="1.8.2"/>

        <file category="header" name="Device\SDK\cfgwiz\TLE9861QXA20\scu_defines.h" attr="config" condition="TLE9861QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9867QXA20\scu_defines.h" attr="config" condition="TLE9867QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9867QXA40\scu_defines.h" attr="config" condition="TLE9867QXA40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9867QXA40\scu_defines.h" attr="config" condition="TLE9867QXW40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9869QXA20\scu_defines.h" attr="config" condition="TLE9869QXA20" version="1.8.2"/>      

        <file category="header"  name="Device\SDK\cfgwiz\common\pmu_defines.h" attr="config" condition="TLE986x" version="1.8.2"/>      

        <file category="header"  name="Device\SDK\cfgwiz\TLE9861QXA20\adc1_defines.h" attr="config" condition="TLE9861QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA20\adc1_defines.h" attr="config" condition="TLE9867QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\adc1_defines.h" attr="config" condition="TLE9867QXA40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\adc1_defines.h" attr="config" condition="TLE9867QXW40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9869QXA20\adc1_defines.h" attr="config" condition="TLE9869QXA20" version="1.8.2"/>      

        <file category="header"  name="Device\SDK\cfgwiz\TLE9861QXA20\adc2_defines.h" attr="config" condition="TLE9861QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA20\adc2_defines.h" attr="config" condition="TLE9867QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\adc2_defines.h" attr="config" condition="TLE9867QXA40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\adc2_defines.h" attr="config" condition="TLE9867QXW40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9869QXA20\adc2_defines.h" attr="config" condition="TLE9869QXA20" version="1.8.2"/>      

        <file category="header"  name="Device\SDK\cfgwiz\common\bdrv_defines.h" attr="config" condition="TLE986x" version="1.8.2"/>      

        <file category="header"  name="Device\SDK\cfgwiz\TLE9861QXA20\ccu6_defines.h" attr="config" condition="TLE9861QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA20\ccu6_defines.h" attr="config" condition="TLE9867QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\ccu6_defines.h" attr="config" condition="TLE9867QXA40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\ccu6_defines.h" attr="config" condition="TLE9867QXW40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9869QXA20\ccu6_defines.h" attr="config" condition="TLE9869QXA20" version="1.8.2"/>      

        <file category="header"  name="Device\SDK\cfgwiz\common\csa_defines.h" attr="config" condition="TLE986x" version="1.8.2"/>      

