t21/Walnut_X/Packages/.cache/Infineon.TLE986x_DFP.1.2.4.pdsc
        <file category="header"  name="Device\SDK\cfgwiz\TLE9861QXA20\gpt12e_defines.h" attr="config" condition="TLE9861QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA20\gpt12e_defines.h" attr="config" condition="TLE9867QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\gpt12e_defines.h" attr="config" condition="TLE9867QXA40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\gpt12e_defines.h" attr="config" condition="TLE9867QXW40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9869QXA20\gpt12e_defines.h" attr="config" condition="TLE9869QXA20" version="1.8.2"/>      

        <file category="header"  name="Device\SDK\cfgwiz\common\int_defines.h" attr="config" condition="TLE986x" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\common\isr_defines.h" attr="config" condition="TLE986x" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\common\lin_defines.h" attr="config" condition="TLE986x" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\common\mon_defines.h" attr="config" condition="TLE986x" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\common\port_defines.h" attr="config" condition="TLE986x" version="1.8.2"/>      

        <file category="header"  name="Device\SDK\cfgwiz\TLE9861QXA20\ssc_defines.h" attr="config" condition="TLE9861QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA20\ssc_defines.h" attr="config" condition="TLE9867QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\ssc_defines.h" attr="config" condition="TLE9867QXA40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\ssc_defines.h" attr="config" condition="TLE9867QXW40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9869QXA20\ssc_defines.h" attr="config" condition="TLE9869QXA20" version="1.8.2"/>      

        <file category="header"  name="Device\SDK\cfgwiz\TLE9861QXA20\timer2x_defines.h" attr="config" condition="TLE9861QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA20\timer2x_defines.h" attr="config" condition="TLE9867QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\timer2x_defines.h" attr="config" condition="TLE9867QXA40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\timer2x_defines.h" attr="config" condition="TLE9867QXW40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9869QXA20\timer2x_defines.h" attr="config" condition="TLE9869QXA20" version="1.8.2"/>      

        <file category="header"  name="Device\SDK\cfgwiz\TLE9861QXA20\timer3_defines.h" attr="config" condition="TLE9861QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA20\timer3_defines.h" attr="config" condition="TLE9867QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\timer3_defines.h" attr="config" condition="TLE9867QXA40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\timer3_defines.h" attr="config" condition="TLE9867QXW40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9869QXA20\timer3_defines.h" attr="config" condition="TLE9869QXA20" version="1.8.2"/>      

        <file category="header"  name="Device\SDK\cfgwiz\TLE9861QXA20\uart_defines.h" attr="config" condition="TLE9861QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA20\uart_defines.h" attr="config" condition="TLE9867QXA20" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\uart_defines.h" attr="config" condition="TLE9867QXA40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9867QXA40\uart_defines.h" attr="config" condition="TLE9867QXW40" version="1.8.2"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9869QXA20\uart_defines.h" attr="config" condition="TLE9869QXA20" version="1.8.2"/>      

        <file category="header"  name="Device\SDK\cfgwiz\common\dma_defines.h" attr="config" condition="TLE986x" version="1.8.2"/>      
        <file category="source" name="Device\SDK\cfgwiz\script\IFX_ePower.xml" attr="config" condition="TLE986x" version="1.2.0"/>      
     </files>
    </component>
  
    <component Cclass="Device" Cgroup="SDK" Csub="SCU" Cversion="0.2.8" condition="TLE986x CMSIS Device">
      <description>System Control Unit (SCU) driver for TLE986x</description>
      <files>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\scu.c"/>      
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" Cversion="0.2.0" condition="TLE986x CMSIS Device">
      <description>BootROM driver for TLE986x</description>
      <files>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\bootrom.c" />      
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="WDT1" Cversion="0.2.4" condition="TLE986x CMSIS Device">
      <description>Watchdog 1 (WDT1) driver for TLE986x</description>
      <files>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\wdt1.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="PMU" Cversion="0.1.1" condition="TLE986x CMSIS Device">
      <description>Power Management Unit (SCU) driver for TLE986x</description>
      <files>
        <file category="include" name="Device\SDK\cfgwiz\common\"/>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\pmu.c"/>      
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="ADC1" Cversion="0.1.3" condition="TLE986x CMSIS Device">
      <description>Analog Digital Converter 1 (ADC1) driver for TLE986x</description>
      <files>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\adc1.c"/>      
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="ADC2" Cversion="0.1.3" condition="TLE986x CMSIS Device">
      <description>Analog Digital Converter 2 (ADC2) driver for TLE986x</description>
      <files>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\adc2.c"/>      
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="BDRV" Cversion="0.3.2" condition="TLE986x CMSIS Device">
      <description>Bridge Driver (BDRV) driver for TLE986x</description>
      <files>
        <file category="include" name="Device\SDK\cfgwiz\common\"/>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\bdrv.c"/>      
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="CCU6" Cversion="0.2.1" condition="TLE986x CMSIS Device">
      <description>Capture Compare Unit (CCU6) driver for TLE986x</description>
      <files>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\ccu6.c"/>      
  	  </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="CSA" Cversion="0.1.1" condition="TLE986x CMSIS Device">
      <description>Current Sense Amplifier (CSA) driver for TLE986x</description>
      <files>
        <file category="include" name="Device\SDK\cfgwiz\common\"/>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\csa.c"/>      
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="GPT12E" Cversion="0.1.2" condition="TLE986x CMSIS Device">
      <description>General Purpose Timer 12E (GPT12E) driver for TLE986x</description>
      <files>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\gpt12e.c"/>      
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="INT" Cversion="0.1.2" condition="TLE986x CMSIS Device">
      <description>Interrupt (INT) driver for TLE986x</description>
      <files>
        <file category="include" name="Device\SDK\cfgwiz\common\"/>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\int.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="ISR" Cversion="0.1.4" condition="TLE986x CMSIS Device">
      <description>Interrupt Service Routines (ISR) driver for TLE986x</description>
      <files>
        <file category="include" name="Device\SDK\cfgwiz\common\"/>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\isr.c"/>      
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="LIN" Cversion="0.1.3" condition="TLE986x CMSIS Device">
      <description>LIN Tranceiver (LIN) driver for TLE986x</description>
      <files>
        <file category="include" name="Device\SDK\cfgwiz\common\"/>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\lin.c"/>      
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="MON" Cversion="0.1.1" condition="TLE986x CMSIS Device">
      <description>High Voltage Monitor Input (MON) driver for TLE986x</description>
      <files>
        <file category="include" name="Device\SDK\cfgwiz\common\"/>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\mon.c"/>      
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="PORT" Cversion="0.5.1" condition="TLE986x CMSIS Device">
      <description>GPIO Ports (PORT) driver for TLE986x</description>
      <files>
        <file category="include" name="Device\SDK\cfgwiz\common\"/>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\port.c"/>      
      </files>
    </component>

